---
kind: property
id: P:Autodesk.Revit.DB.FamilyElementVisibility.IsShownInMedium
source: html/001f297f-a413-1c47-3374-52368a1dc157.htm
---
# Autodesk.Revit.DB.FamilyElementVisibility.IsShownInMedium Property

Indicates if the instance is display with Medium detail level in the view
of project document.

## Syntax (C#)
```csharp
public bool IsShownInMedium { get; set; }
```

## Remarks
This property cannot be set to false if the other two detail levels are also false.